Revit 2024 API
IExternalApplication.OnStartup Method
Implement this method to execute some tasks when Autodesk Revit starts.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
Result OnStartup(
	UIControlledApplication application
)
Visual Basic
Function OnStartup ( _
	application As UIControlledApplication _
) As Result
Visual C++
Result OnStartup(
	UIControlledApplication^ application
)
Parameters
application
Type: Autodesk.Revit.UI.UIControlledApplication
A handle to the application being started.
Return Value
Indicates if the external application completes its work successfully.
See Also
IExternalApplication Interface
Autodesk.Revit.UI Namespace